/*! @file
********************************************************************************
<PRE>
模块名       : 硬件驱动模块
文件名       : drvSerial.c
相关文件     :
文件实现功能 : 串口驱动
作者         : <---->
版本         : 1.0
--------------------------------------------------------------------------------
备注         :
--------------------------------------------------------------------------------
修改记录 :
日 期        版本   修改人         修改内容
2010/10/15   1.0    <---->         创建
</PRE>
********************************************************************************

  * 版权所有(c) YYYY, <xxx>, 保留所有权利

*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "Include.h"
#include "string.h"
#include "drvSerial.h"
/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/


/* Private variables ---------------------------------------------------------*/
//USART_TypeDef *USART = USART1;

volatile u8 USART_RX_Buf[USART_RX_BUF_MAX];		// 队列
volatile u8 USART_TX_Buf[USART_TX_BUF_MAX];		// 队列

volatile u32 USART_Rx_Head=0;					// 队列头-接收的时候移动
volatile u32 USART_Rx_Tail=0;					// 队列尾-读取的时候移动
volatile u32 USART_Count = 0;
volatile u32 USART_Tx_Head=0;					// 队列头-接收的时候移动
volatile u32 USART_Tx_Tail=0;					// 队列尾-读取的时候移动

volatile u32 USART_Rx_HeadEnd=0;				// 队列头-接收的时候移动
volatile u32 USART_Rx_TailEnd=0;				// 队列尾-读取的时候移动
/* Private function prototypes -----------------------------------------------*/
// 启动/停止发送
void UASRT_BeginSend(void);
void UASRT_StopSend(void);

/* Private functions ---------------------------------------------------------*/

/****************************************************************************************
** 函数名称: USART_PutDatatoRxBuf
** 功能描述: 把接收数据放进队列中
** 参    数: u8 dat-数据
** 返 回 值: void
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
void USART_PutDatatoRxBuf(u8 dat)
{
	u32 tmphead;
	tmphead = ( USART_Rx_Head + 1 ) & USART_RX_BUF_MARK;//队列头的最大值判断,到达最大,则变回0
	USART_Rx_Head = tmphead; 	// 每收一次数据,队列头增加1
	USART_RX_Buf[tmphead] = dat;
}

/****************************************************************************************
** 函数名称: USART_PutDatatoRxBuf
** 功能描述: 获知接收队列中是否有数据
** 参    数: void
** 返 回 值: bool
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
bool USART_IsDataInRxBuf(void)
{
	if( USART_Rx_Head == USART_Rx_Tail )
		return FALSE;
	else
		return TRUE;
}

/****************************************************************************************
** 函数名称: USART_PutDatatoRxBuf
** 功能描述: 获取接收队列中有效数据的长度
** 参    数: void
** 返 回 值: u32
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
u32 USART_GetRxBufLen(void)
{
	if(USART_Rx_Head>=USART_Rx_Tail)
	{
		return(USART_Rx_Head-USART_Rx_Tail);
	}
	else
	{
		return(USART_RX_BUF_MAX+USART_Rx_Head-USART_Rx_Tail);
	}
}

/****************************************************************************************
** 函数名称: USART_GetRxBufData
** 功能描述: 从接收队列中获取数据,调用此函数前请先确保队列中有数据!!否则会陷入硬等待
** 参    数: void
** 返 回 值: u8
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
u8 USART_GetRxBufData(void)
{
	u32 tmptail;
	while ( USART_Rx_Head == USART_Rx_Tail );//为防止数据混乱而弄上的硬等待
	tmptail = ( USART_Rx_Tail + 1 ) & USART_RX_BUF_MARK;
	USART_Rx_Tail = tmptail;
	return USART_RX_Buf[tmptail];
}

/****************************************************************************************
** 函数名称: USART_GetRxData
** 功能描述: 从接收队列中获取数据
** 参    数: u8 *pData, u16 len
** 返 回 值: COM_STATUS
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
COM_STATUS USART_GetRxString(u8 *pData, u16 len)
{
	u16 i = 0;
	if (USART_GetRxBufLen() < len)
	{
		return COM_STATUS_LENERR;
	}
	else
	{
		for (i = 0; i < len; i++)
		{
			*(pData + i) = USART_GetRxBufData();
		}
		return COM_STATUS_OK;
	}
}



//////////////////////////////////////////
//	以下函数为发送相关
//////////////////////////////////////////

/****************************************************************************************
** 函数名称: USART_PutDatatoTxBuf
** 功能描述: 把发送数据放进发送队列中
** 参    数: u8 dat
** 返 回 值: bool
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
bool USART_PutDatatoTxBuf(u8 dat)
{
	u32 tmphead;
	tmphead = ( USART_Tx_Head + 1 ) & USART_TX_BUF_MARK;//队列末端判断,到达末端,则变回0
	if(tmphead==USART_Tx_Tail)
		return FALSE;

	USART_Tx_Head = tmphead; 	// 每入列,队列头增加1
	USART_TX_Buf[tmphead] = dat;
	return TRUE;
}

/****************************************************************************************
** 函数名称: USART_IsDataInTxBuf
** 功能描述: 获知发送队列中是否有数据
** 参    数: void
** 返 回 值: bool
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
bool USART_IsDataInTxBuf(void)
{
	if( USART_Tx_Head == USART_Tx_Tail )
		return FALSE;
	else
		return TRUE;
}

/****************************************************************************************
** 函数名称: USART_GetTxBufLen
** 功能描述: 获取队列中有效数据的长度
** 参    数: void
** 返 回 值: u32
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
u32 USART_GetTxBufLen(void)
{
	if(USART_Tx_Head>=USART_Tx_Tail)
	{
		return(USART_TX_BUF_MAX-(USART_Tx_Head-USART_Tx_Tail));
	}
	else
	{
		return(USART_Tx_Tail-USART_Tx_Head);
	}
}

/****************************************************************************************
** 函数名称: USART_GetTxBufData
** 功能描述: 从发送队列中获取数据
** 参    数: void
** 返 回 值: u32
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
u8 USART_GetTxBufData(void)
{
	u32 tmptail;
	while ( USART_Tx_Head == USART_Tx_Tail );//为防止数据混乱而弄上的硬等待
	tmptail = ( USART_Tx_Tail + 1 ) & USART_TX_BUF_MARK;
	USART_Tx_Tail = tmptail;
	return USART_TX_Buf[tmptail];
}

COM_STATUS USART_PutTxString(u8 *pData, u16 len)
{
	u16 i = 0;

	if (len > USART_TX_BUF_MAX)
	{
		return COM_STATUS_LENERR;
	}
	for (i = 0; i < len; i++)
	{
		USART_PutDatatoTxBuf(*(pData+i));//则直接放到发送队列中发送
	}
	UASRT_BeginSend();
	return COM_STATUS_OK;
}

/****************************************************************************************
** 函数名称: UASRT_BeginSend/UASRT_StopSend
** 功能描述: 启动/停止发送,使用空中断方式发送,只要发送寄存器为空,则会进入发送空中断,系统再在中断中进行发送
** 参    数: void
** 返 回 值: u32
** 作　  者:
** 日  　期: 2009年10月11日
**---------------------------------------------------------------------------------------
** 修 改 人:
** 日　  期:
**--------------------------------------------------------------------------------------
****************************************************************************************/
void UASRT_BeginSend(void)
{
	USART_ITConfig(USART1,USART_IT_TXE,ENABLE);
}

void UASRT_StopSend(void)
{
	USART_ITConfig(USART1,USART_IT_TXE,DISABLE);
}

void SERIAL_IRQHandler(void)
{
	//接收中断
	if(USART_GetITStatus(USART1,USART_IT_RXNE)==SET)
	{
		USART_ClearITPendingBit(USART1,USART_IT_RXNE);
		USART_PutDatatoRxBuf(USART_ReceiveData(USART1));
	}

	//发送空中断
	if(USART_GetITStatus(USART1,USART_IT_TXE)==SET)
	{
		if(USART_IsDataInTxBuf()==TRUE)
		{
			USART_SendData(USART1, USART_GetTxBufData());
		}
		else
		{
			UASRT_StopSend();
		}
	}

	//溢出处理-如果发生溢出需要先清除ORE,再读DR寄存器 则可清除不断入中断的问题
	if(USART_GetFlagStatus(USART1,USART_FLAG_ORE)==SET)
	{
		USART_ClearFlag(USART1,USART_FLAG_ORE);	//清除ORE
		USART_ReceiveData(USART1);				//读DR
	}

}
